docs/req.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservice.ftp.oipPlugin.starit.com.cn">
    <soapenv:Header>
      <Esb>
         <Route>
            <Sender>10.1103</Sender>
            <Time>2011-10-20 11:35:14.014</Time>
            <ServCode>10.1111.fileUpload.SynReq</ServCode>
            <MsgId>test1004</MsgId>
            <AuthCode/>
            <TransId>44.1101_1803782</TransId>
            <CarryType>0</CarryType>
            <ServTestFlag>0</ServTestFlag>
         </Route>
      </Esb>
   </soapenv:Header>
   <soapenv:Body>
      <web:upload>
         <!--Optional:-->
         <web:Request><![CDATA[<ReqRoot> <FromSysCode>10.1103</FromSysCode>
				 <ReqTime>2012-04-19 21:43:00</ReqTime>
				 <BillNo>10.1103_1234567890</BillNo>
				 <FromProtocol>sftp</FromProtocol>
				 <FromIp>132.129.31.217</FromIp>
				 <FromPort>22</FromPort>
				 <FromUser>tsaip</FromUser>
				 <FromPassword>testoip</FromPassword>
				 <ToSysCode></ToSysCode>
				 <TaskList>
				 <Task from="/home/tsaip/test/file4.txt"  ftpTargetCode ="10.1103.test"/>
				 <Task from="/home/tsaip/test/file5.txt"  ftpTargetCode="10.1103.test"/>
				 </TaskList>  </ReqRoot>]]></web:Request>
      </web:upload>
   </soapenv:Body>
</soapenv:Envelope>